#### Terraform Format and Style 🖌`success`

<details><summary>Show Formatting</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`

<details><summary>Show Initialization</summary>

```

[0m[1mInitializing modules...[0m
Downloading registry.terraform.io/cloudposse/ecr/aws 0.32.3 for ecr...
- ecr in .terraform/modules/ecr
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for ecr.this...
- ecr.this in .terraform/modules/ecr.this
Downloading registry.terraform.io/cloudposse/eks-cluster/aws 0.45.0 for eks_cluster...
- eks_cluster in .terraform/modules/eks_cluster
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_cluster.label...
- eks_cluster.label in .terraform/modules/eks_cluster.label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_cluster.this...
- eks_cluster.this in .terraform/modules/eks_cluster.this
Downloading registry.terraform.io/cloudposse/eks-fargate-profile/aws 0.9.2 for eks_fargate_profile...
- eks_fargate_profile in .terraform/modules/eks_fargate_profile
Downloading registry.terraform.io/cloudposse/label/null 0.24.1 for eks_fargate_profile.label...
- eks_fargate_profile.label in .terraform/modules/eks_fargate_profile.label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_fargate_profile.this...
- eks_fargate_profile.this in .terraform/modules/eks_fargate_profile.this
Downloading registry.terraform.io/cloudposse/eks-node-group/aws 0.27.3 for eks_node_group...
- eks_node_group in .terraform/modules/eks_node_group
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_node_group.label...
- eks_node_group.label in .terraform/modules/eks_node_group.label
Downloading registry.terraform.io/cloudposse/security-group/aws 0.4.3 for eks_node_group.ssh_access...
- eks_node_group.ssh_access in .terraform/modules/eks_node_group.ssh_access
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_node_group.ssh_access.this...
- eks_node_group.ssh_access.this in .terraform/modules/eks_node_group.ssh_access.this
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for eks_node_group.this...
- eks_node_group.this in .terraform/modules/eks_node_group.this
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for label...
- label in .terraform/modules/label
Downloading registry.terraform.io/cloudposse/dynamic-subnets/aws 0.39.8 for subnets...
- subnets in .terraform/modules/subnets
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.nat_instance_label...
- subnets.nat_instance_label in .terraform/modules/subnets.nat_instance_label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.nat_label...
- subnets.nat_label in .terraform/modules/subnets.nat_label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.private_label...
- subnets.private_label in .terraform/modules/subnets.private_label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.public_label...
- subnets.public_label in .terraform/modules/subnets.public_label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.this...
- subnets.this in .terraform/modules/subnets.this
Downloading registry.terraform.io/cloudposse/utils/aws 0.8.1 for subnets.utils...
- subnets.utils in .terraform/modules/subnets.utils
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for subnets.utils.this...
- subnets.utils.this in .terraform/modules/subnets.utils.this
Downloading registry.terraform.io/cloudposse/vpc/aws 0.28.1 for vpc...
- vpc in .terraform/modules/vpc
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for vpc.label...
- vpc.label in .terraform/modules/vpc.label
Downloading registry.terraform.io/cloudposse/label/null 0.25.0 for vpc.this...
- vpc.this in .terraform/modules/vpc.this

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/local versions matching ">= 1.3.0"...
- Finding hashicorp/template versions matching ">= 2.0.0"...
- Finding hashicorp/random versions matching ">= 2.0.0"...
- Finding hashicorp/aws versions matching ">= 2.0.0, >= 3.0.0, >= 3.1.0, >= 3.38.0, >= 3.56.0, >= 3.62.0, ~> 4.1.0"...
- Finding hashicorp/kubernetes versions matching ">= 2.7.1"...
- Finding hashicorp/tls versions matching ">= 3.1.0"...
- Finding hashicorp/null versions matching ">= 2.0.0"...
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/aws v4.1.0...
- Installed hashicorp/aws v4.1.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.8.0...
- Installed hashicorp/kubernetes v2.8.0 (signed by HashiCorp)
- Installing hashicorp/tls v3.1.0...
- Installed hashicorp/tls v3.1.0 (signed by HashiCorp)
- Installing hashicorp/null v3.1.0...
- Installed hashicorp/null v3.1.0 (signed by HashiCorp)
- Installing hashicorp/local v2.1.0...
- Installed hashicorp/local v2.1.0 (signed by HashiCorp)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

</details>

#### Terraform Validation 🤖`success`

<details><summary>Show Validation</summary>

```


Warning: Argument is deprecated

  with module.ecr.data.aws_iam_policy_document.resource,
  on .terraform/modules/ecr/main.tf line 138, in data "aws_iam_policy_document" "resource":
 138:   source_json   = local.principals_readonly_access_non_empty ? join("", [data.aws_iam_policy_document.resource_readonly_access[0].json]) : join("", [data.aws_iam_policy_document.empty[0].json])

Use the attribute "source_policy_documents" instead.

(and 2 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.lb_controller will be created
  + resource "aws_iam_policy" "lb_controller" {
      + arn         = (known after apply)
      + description = "IAM policy for the AWS Load Balancer Controller that allows it to make calls to AWS APIs on your behalf."
      + id          = (known after apply)
      + name        = "AWSLoadBalancerControllerIAMPolicy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + iam:AWSServiceName = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                          + StringEquals = {
                              + ec2:CreateAction = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.lb-role will be created
  + resource "aws_iam_role" "lb-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "load-balancer-role-trust-policy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lb-attach will be created
  + resource "aws_iam_role_policy_attachment" "lb-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "load-balancer-role-trust-policy"
    }

  # module.ecr.data.aws_iam_policy_document.resource[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "resource"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)
      + source_json   = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
    }

  # module.ecr.data.aws_iam_policy_document.resource_full_access[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "resource_full_access"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "ecr:*",
            ]
          + effect  = "Allow"
          + sid     = "FullAccess"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.name["silver-spork"] will be created
  + resource "aws_ecr_lifecycle_policy" "name" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Rotate images when reach 500 images stored"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 500
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "silver-spork"
    }

  # module.ecr.aws_ecr_repository.name["silver-spork"] will be created
  + resource "aws_ecr_repository" "name" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "silver-spork"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.name["silver-spork"] will be created
  + resource "aws_ecr_repository_policy" "name" {
      + id          = (known after apply)
      + policy      = (known after apply)
      + registry_id = (known after apply)
      + repository  = "silver-spork"
    }

  # module.eks_cluster.data.aws_eks_cluster_auth.eks[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "eks"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks_cluster.data.tls_certificate.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_cluster.aws_eks_cluster.default[0] will be created
  + resource "aws_eks_cluster" "default" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eg-test-eks-fargate-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + version               = "1.21"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_cluster.aws_iam_openid_connect_provider.default[0] will be created
  + resource "aws_iam_openid_connect_provider" "default" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_cluster.aws_iam_policy.cluster_elb_service_role[0] will be created
  + resource "aws_iam_policy" "cluster_elb_service_role" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eg-test-eks-fargate-cluster-ServiceRole"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowElasticLoadBalancer"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenyCreateLogGroup"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.eks_cluster.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eg-test-eks-fargate-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_cluster_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eg-test-eks-fargate-cluster"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_service_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eg-test-eks-fargate-cluster"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.cluster_elb_service_role[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_service_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eg-test-eks-fargate-cluster"
    }

  # module.eks_cluster.aws_kms_alias.cluster[0] will be created
  + resource "aws_kms_alias" "cluster" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eg-test-eks-fargate-cluster"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks_cluster.aws_kms_key.cluster[0] will be created
  + resource "aws_kms_key" "cluster" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "EKS Cluster eg-test-eks-fargate-cluster Encryption Config KMS Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
    }

  # module.eks_cluster.kubernetes_config_map.aws_auth_ignore_changes[0] will be created
  + resource "kubernetes_config_map" "aws_auth_ignore_changes" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_cluster.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id = (known after apply)
    }

  # module.eks_fargate_profile.aws_eks_fargate_profile.default[0] will be created
  + resource "aws_eks_fargate_profile" "default" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "eg-test-eks-fargate-cluster-fargate"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)

      + selector {
          + namespace = "default"
        }
    }

  # module.eks_fargate_profile.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eg-test-eks-fargate-cluster-fargate@default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_fargate_profile.aws_iam_role_policy_attachment.amazon_eks_fargate_pod_execution_role_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "eg-test-eks-fargate-cluster-fargate@default"
    }

  # module.eks_node_group.aws_eks_node_group.default[0] will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "eg-test-eks-fargate-cluster-workers"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks_node_group.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eg-test-eks-fargate-cluster-workers"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "cluster-workers"
          + "Name"       = "eg-test-eks-fargate-cluster-workers"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "Attributes" = "cluster-workers"
          + "Name"       = "eg-test-eks-fargate-cluster-workers"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_node_group.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eg-test-eks-fargate-cluster-workers"
    }

  # module.eks_node_group.aws_iam_role_policy_attachment.amazon_eks_cni_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eg-test-eks-fargate-cluster-workers"
    }

  # module.eks_node_group.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eg-test-eks-fargate-cluster-workers"
    }

  # module.eks_node_group.aws_launch_template.default[0] will be created
  + resource "aws_launch_template" "default" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "false"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eg-test-eks-fargate-cluster-workers"
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + update_default_version = true

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 20
              + volume_type           = "gp2"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }
    }

  # module.subnets.data.aws_vpc.default[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "default"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.subnets.aws_eip.default[0] will be created
  + resource "aws_eip" "default" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all             = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc                  = true
    }

  # module.subnets.aws_eip.default[1] will be created
  + resource "aws_eip" "default" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all             = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc                  = true
    }

  # module.subnets.aws_nat_gateway.default[0] will be created
  + resource "aws_nat_gateway" "default" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster-nat-use2a"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster-nat-use2a"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
    }

  # module.subnets.aws_nat_gateway.default[1] will be created
  + resource "aws_nat_gateway" "default" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster-nat-use2b"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster-nat-use2b"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
    }

  # module.subnets.aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all   = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id     = (known after apply)
    }

  # module.subnets.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all   = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id     = (known after apply)
    }

  # module.subnets.aws_route.default[0] will be created
  + resource "aws_route" "default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "2m"
          + delete = "5m"
        }
    }

  # module.subnets.aws_route.default[1] will be created
  + resource "aws_route" "default" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "2m"
          + delete = "5m"
        }
    }

  # module.subnets.aws_route.public[0] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "2m"
          + delete = "5m"
        }
    }

  # module.subnets.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all         = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.subnets.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all         = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.subnets.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all         = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.subnets.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all                                       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all                                       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-private-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-public-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all                                       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-public-use2a"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnets.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.128.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-public-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all                                       = {
          + "Attributes"          = "cluster"
          + "Name"                = "eg-test-eks-fargate-cluster-public-use2b"
          + "Namespace"           = "eg"
          + "Stage"               = "test"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "cluster"
          + "Name"       = "Default Security Group"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "Attributes" = "cluster"
          + "Name"       = "Default Security Group"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = false
      + enable_classiclink_dns_support       = false
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
      + tags_all                             = {
          + "Attributes" = "cluster"
          + "Name"       = "eg-test-eks-fargate-cluster"
          + "Namespace"  = "eg"
          + "Stage"      = "test"
          + "Terraform"  = "true"
        }
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ecr.data.aws_iam_policy_document.resource,
  on .terraform/modules/ecr/main.tf line 138, in data "aws_iam_policy_document" "resource":
 138:   source_json   = local.principals_readonly_access_non_empty ? join("", [data.aws_iam_policy_document.resource_readonly_access[0].json]) : join("", [data.aws_iam_policy_document.empty[0].json])

Use the attribute "source_policy_documents" instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jaustinpage, Action: `push`, Workflow: `Python`*